Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pmu.h
/*
 * Component description for PMU
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-05-31T11:02:56Z */
#ifndef _BZ25_PMU_COMPONENT_H_
#define _BZ25_PMU_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PMU                                          */
/* ************************************************************************** */

/* -------- PMU_SPICTRL : (PMU Offset: 0x00) (R/W 32)  -------- */
#define PMU_SPICTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (PMU_SPICTRL)   Reset Value */

#define PMU_SPICTRL_SPIWDATA_Pos              _UINT32_(0)                                          /* (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_SPIWDATA_Msk              (_UINT32_(0xFFFF) << PMU_SPICTRL_SPIWDATA_Pos)       /* (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_SPIWDATA(value)           (PMU_SPICTRL_SPIWDATA_Msk & (_UINT32_(value) << PMU_SPICTRL_SPIWDATA_Pos)) /* Assigment of value for SPIWDATA in the PMU_SPICTRL register */
#define PMU_SPICTRL_SPIADDR_Pos               _UINT32_(16)                                         /* (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_SPIADDR_Msk               (_UINT32_(0xFF) << PMU_SPICTRL_SPIADDR_Pos)          /* (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_SPIADDR(value)            (PMU_SPICTRL_SPIADDR_Msk & (_UINT32_(value) << PMU_SPICTRL_SPIADDR_Pos)) /* Assigment of value for SPIADDR in the PMU_SPICTRL register */
#define PMU_SPICTRL_CMD_Pos                   _UINT32_(24)                                         /* (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_CMD_Msk                   (_UINT32_(0x1) << PMU_SPICTRL_CMD_Pos)               /* (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_CMD(value)                (PMU_SPICTRL_CMD_Msk & (_UINT32_(value) << PMU_SPICTRL_CMD_Pos)) /* Assigment of value for CMD in the PMU_SPICTRL register */
#define PMU_SPICTRL_PMUCRST_Pos               _UINT32_(30)                                         /* (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_PMUCRST_Msk               (_UINT32_(0x1) << PMU_SPICTRL_PMUCRST_Pos)           /* (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_PMUCRST(value)            (PMU_SPICTRL_PMUCRST_Msk & (_UINT32_(value) << PMU_SPICTRL_PMUCRST_Pos)) /* Assigment of value for PMUCRST in the PMU_SPICTRL register */
#define PMU_SPICTRL_SPIRST_Pos                _UINT32_(31)                                         /* (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_SPIRST_Msk                (_UINT32_(0x1) << PMU_SPICTRL_SPIRST_Pos)            /* (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_SPIRST(value)             (PMU_SPICTRL_SPIRST_Msk & (_UINT32_(value) << PMU_SPICTRL_SPIRST_Pos)) /* Assigment of value for SPIRST in the PMU_SPICTRL register */
#define PMU_SPICTRL_Msk                       _UINT32_(0xC1FFFFFF)                                 /* (PMU_SPICTRL) Register Mask  */


/* -------- PMU_SPISTATUS : (PMU Offset: 0x04) (R/W 32)  -------- */
#define PMU_SPISTATUS_RESETVALUE              _UINT32_(0x00)                                       /*  (PMU_SPISTATUS)   Reset Value */

#define PMU_SPISTATUS_SPIERR_Pos              _UINT32_(0)                                          /* (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIERR_Msk              (_UINT32_(0x1) << PMU_SPISTATUS_SPIERR_Pos)          /* (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIERR(value)           (PMU_SPISTATUS_SPIERR_Msk & (_UINT32_(value) << PMU_SPISTATUS_SPIERR_Pos)) /* Assigment of value for SPIERR in the PMU_SPISTATUS register */
#define PMU_SPISTATUS_SPIRDY_Pos              _UINT32_(7)                                          /* (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIRDY_Msk              (_UINT32_(0x1) << PMU_SPISTATUS_SPIRDY_Pos)          /* (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIRDY(value)           (PMU_SPISTATUS_SPIRDY_Msk & (_UINT32_(value) << PMU_SPISTATUS_SPIRDY_Pos)) /* Assigment of value for SPIRDY in the PMU_SPISTATUS register */
#define PMU_SPISTATUS_SPIADDR_Pos             _UINT32_(8)                                          /* (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIADDR_Msk             (_UINT32_(0xFF) << PMU_SPISTATUS_SPIADDR_Pos)        /* (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIADDR(value)          (PMU_SPISTATUS_SPIADDR_Msk & (_UINT32_(value) << PMU_SPISTATUS_SPIADDR_Pos)) /* Assigment of value for SPIADDR in the PMU_SPISTATUS register */
#define PMU_SPISTATUS_SPIRDATA_Pos            _UINT32_(16)                                         /* (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIRDATA_Msk            (_UINT32_(0xFFFF) << PMU_SPISTATUS_SPIRDATA_Pos)     /* (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIRDATA(value)         (PMU_SPISTATUS_SPIRDATA_Msk & (_UINT32_(value) << PMU_SPISTATUS_SPIRDATA_Pos)) /* Assigment of value for SPIRDATA in the PMU_SPISTATUS register */
#define PMU_SPISTATUS_Msk                     _UINT32_(0xFFFFFF81)                                 /* (PMU_SPISTATUS) Register Mask  */


/* -------- PMU_CLKCTRL : (PMU Offset: 0x08) (R/W 32)  -------- */
#define PMU_CLKCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (PMU_CLKCTRL)   Reset Value */

