Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pmu.h
#define PMU_CLKCTRL_SPICLKDIV_Pos             _UINT32_(0)                                          /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_SPICLKDIV_Msk             (_UINT32_(0x3F) << PMU_CLKCTRL_SPICLKDIV_Pos)        /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_SPICLKDIV(value)          (PMU_CLKCTRL_SPICLKDIV_Msk & (_UINT32_(value) << PMU_CLKCTRL_SPICLKDIV_Pos)) /* Assigment of value for SPICLKDIV in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_PMUANA_BKBOREN_Pos        _UINT32_(6)                                          /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_PMUANA_BKBOREN_Msk        (_UINT32_(0x1) << PMU_CLKCTRL_PMUANA_BKBOREN_Pos)    /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_PMUANA_BKBOREN(value)     (PMU_CLKCTRL_PMUANA_BKBOREN_Msk & (_UINT32_(value) << PMU_CLKCTRL_PMUANA_BKBOREN_Pos)) /* Assigment of value for PMUANA_BKBOREN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_SPISRC_Pos                _UINT32_(7)                                          /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_SPISRC_Msk                (_UINT32_(0x1) << PMU_CLKCTRL_SPISRC_Pos)            /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_SPISRC(value)             (PMU_CLKCTRL_SPISRC_Msk & (_UINT32_(value) << PMU_CLKCTRL_SPISRC_Pos)) /* Assigment of value for SPISRC in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_BUCKCLKDIV_Pos            _UINT32_(8)                                          /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BUCKCLKDIV_Msk            (_UINT32_(0x3F) << PMU_CLKCTRL_BUCKCLKDIV_Pos)       /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BUCKCLKDIV(value)         (PMU_CLKCTRL_BUCKCLKDIV_Msk & (_UINT32_(value) << PMU_CLKCTRL_BUCKCLKDIV_Pos)) /* Assigment of value for BUCKCLKDIV in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_BUCKSRC_Pos               _UINT32_(14)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BUCKSRC_Msk               (_UINT32_(0x3) << PMU_CLKCTRL_BUCKSRC_Pos)           /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BUCKSRC(value)            (PMU_CLKCTRL_BUCKSRC_Msk & (_UINT32_(value) << PMU_CLKCTRL_BUCKSRC_Pos)) /* Assigment of value for BUCKSRC in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_BACWD_Pos                 _UINT32_(16)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BACWD_Msk                 (_UINT32_(0x1) << PMU_CLKCTRL_BACWD_Pos)             /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BACWD(value)              (PMU_CLKCTRL_BACWD_Msk & (_UINT32_(value) << PMU_CLKCTRL_BACWD_Pos)) /* Assigment of value for BACWD in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_MLDOEXTEN_Pos             _UINT32_(17)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_MLDOEXTEN_Msk             (_UINT32_(0x1) << PMU_CLKCTRL_MLDOEXTEN_Pos)         /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_MLDOEXTEN(value)          (PMU_CLKCTRL_MLDOEXTEN_Msk & (_UINT32_(value) << PMU_CLKCTRL_MLDOEXTEN_Pos)) /* Assigment of value for MLDOEXTEN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_MVREFFSMEN_Pos            _UINT32_(18)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_MVREFFSMEN_Msk            (_UINT32_(0x1) << PMU_CLKCTRL_MVREFFSMEN_Pos)        /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_MVREFFSMEN(value)         (PMU_CLKCTRL_MVREFFSMEN_Msk & (_UINT32_(value) << PMU_CLKCTRL_MVREFFSMEN_Pos)) /* Assigment of value for MVREFFSMEN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_CMP_CYCLE_Pos             _UINT32_(20)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_CMP_CYCLE_Msk             (_UINT32_(0xF) << PMU_CLKCTRL_CMP_CYCLE_Pos)         /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_CMP_CYCLE(value)          (PMU_CLKCTRL_CMP_CYCLE_Msk & (_UINT32_(value) << PMU_CLKCTRL_CMP_CYCLE_Pos)) /* Assigment of value for CMP_CYCLE in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_BKCLK_HW_OVR_Pos          _UINT32_(24)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BKCLK_HW_OVR_Msk          (_UINT32_(0x1) << PMU_CLKCTRL_BKCLK_HW_OVR_Pos)      /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BKCLK_HW_OVR(value)       (PMU_CLKCTRL_BKCLK_HW_OVR_Msk & (_UINT32_(value) << PMU_CLKCTRL_BKCLK_HW_OVR_Pos)) /* Assigment of value for BKCLK_HW_OVR in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_MLDOEXT_BOREN_Pos         _UINT32_(26)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_MLDOEXT_BOREN_Msk         (_UINT32_(0x1) << PMU_CLKCTRL_MLDOEXT_BOREN_Pos)     /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_MLDOEXT_BOREN(value)      (PMU_CLKCTRL_MLDOEXT_BOREN_Msk & (_UINT32_(value) << PMU_CLKCTRL_MLDOEXT_BOREN_Pos)) /* Assigment of value for MLDOEXT_BOREN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_ADCBOREN_Pos              _UINT32_(27)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_ADCBOREN_Msk              (_UINT32_(0x1) << PMU_CLKCTRL_ADCBOREN_Pos)          /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_ADCBOREN(value)           (PMU_CLKCTRL_ADCBOREN_Msk & (_UINT32_(value) << PMU_CLKCTRL_ADCBOREN_Pos)) /* Assigment of value for ADCBOREN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_BUCKBOREN_Pos             _UINT32_(28)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BUCKBOREN_Msk             (_UINT32_(0x1) << PMU_CLKCTRL_BUCKBOREN_Pos)         /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BUCKBOREN(value)          (PMU_CLKCTRL_BUCKBOREN_Msk & (_UINT32_(value) << PMU_CLKCTRL_BUCKBOREN_Pos)) /* Assigment of value for BUCKBOREN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_F_BCLK_CFG_Pos            _UINT32_(29)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_F_BCLK_CFG_Msk            (_UINT32_(0x1) << PMU_CLKCTRL_F_BCLK_CFG_Pos)        /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_F_BCLK_CFG(value)         (PMU_CLKCTRL_F_BCLK_CFG_Msk & (_UINT32_(value) << PMU_CLKCTRL_F_BCLK_CFG_Pos)) /* Assigment of value for F_BCLK_CFG in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_WLDOOFF_Pos               _UINT32_(30)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_WLDOOFF_Msk               (_UINT32_(0x1) << PMU_CLKCTRL_WLDOOFF_Pos)           /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_WLDOOFF(value)            (PMU_CLKCTRL_WLDOOFF_Msk & (_UINT32_(value) << PMU_CLKCTRL_WLDOOFF_Pos)) /* Assigment of value for WLDOOFF in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_WCMRET_Pos                _UINT32_(31)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_WCMRET_Msk                (_UINT32_(0x1) << PMU_CLKCTRL_WCMRET_Pos)            /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_WCMRET(value)             (PMU_CLKCTRL_WCMRET_Msk & (_UINT32_(value) << PMU_CLKCTRL_WCMRET_Pos)) /* Assigment of value for WCMRET in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_Msk                       _UINT32_(0xFDF7FFFF)                                 /* (PMU_CLKCTRL) Register Mask  */


/* -------- PMU_MODECTRL1 : (PMU Offset: 0x0C) (R/W 32)  -------- */
#define PMU_MODECTRL1_RESETVALUE              _UINT32_(0x00)                                       /*  (PMU_MODECTRL1)   Reset Value */

#define PMU_MODECTRL1_VREG4CTRL_Pos           _UINT32_(0)                                          /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG4CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL1_VREG4CTRL_Pos)      /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG4CTRL(value)        (PMU_MODECTRL1_VREG4CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL1_VREG4CTRL_Pos)) /* Assigment of value for VREG4CTRL in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_VREG3CTRL_Pos           _UINT32_(8)                                          /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG3CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL1_VREG3CTRL_Pos)      /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG3CTRL(value)        (PMU_MODECTRL1_VREG3CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL1_VREG3CTRL_Pos)) /* Assigment of value for VREG3CTRL in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_VREG2CTRL_Pos           _UINT32_(16)                                         /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG2CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL1_VREG2CTRL_Pos)      /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG2CTRL(value)        (PMU_MODECTRL1_VREG2CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL1_VREG2CTRL_Pos)) /* Assigment of value for VREG2CTRL in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_VREG1CTRL_Pos           _UINT32_(24)                                         /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG1CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL1_VREG1CTRL_Pos)      /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG1CTRL(value)        (PMU_MODECTRL1_VREG1CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL1_VREG1CTRL_Pos)) /* Assigment of value for VREG1CTRL in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_BUCKMODE_Pos            _UINT32_(29)                                         /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_BUCKMODE_Msk            (_UINT32_(0x1) << PMU_MODECTRL1_BUCKMODE_Pos)        /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_BUCKMODE(value)         (PMU_MODECTRL1_BUCKMODE_Msk & (_UINT32_(value) << PMU_MODECTRL1_BUCKMODE_Pos)) /* Assigment of value for BUCKMODE in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_MLDOEN_Pos              _UINT32_(30)                                         /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_MLDOEN_Msk              (_UINT32_(0x1) << PMU_MODECTRL1_MLDOEN_Pos)          /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_MLDOEN(value)           (PMU_MODECTRL1_MLDOEN_Msk & (_UINT32_(value) << PMU_MODECTRL1_MLDOEN_Pos)) /* Assigment of value for MLDOEN in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_BUCKEN_Pos              _UINT32_(31)                                         /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_BUCKEN_Msk              (_UINT32_(0x1) << PMU_MODECTRL1_BUCKEN_Pos)          /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_BUCKEN(value)           (PMU_MODECTRL1_BUCKEN_Msk & (_UINT32_(value) << PMU_MODECTRL1_BUCKEN_Pos)) /* Assigment of value for BUCKEN in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_Msk                     _UINT32_(0xFF1F1F1F)                                 /* (PMU_MODECTRL1) Register Mask  */


