Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pmu.h
/* -------- PMU_PMUSEQ2 : (PMU Offset: 0x2C) (R/W 32)  -------- */
#define PMU_PMUSEQ2_RESETVALUE                _UINT32_(0x00)                                       /*  (PMU_PMUSEQ2)   Reset Value */

#define PMU_PMUSEQ2_DELAY_Pos                 _UINT32_(0)                                          /* (PMU_PMUSEQ2)  Position */
#define PMU_PMUSEQ2_DELAY_Msk                 (_UINT32_(0x3F) << PMU_PMUSEQ2_DELAY_Pos)            /* (PMU_PMUSEQ2)  Mask */
#define PMU_PMUSEQ2_DELAY(value)              (PMU_PMUSEQ2_DELAY_Msk & (_UINT32_(value) << PMU_PMUSEQ2_DELAY_Pos)) /* Assigment of value for DELAY in the PMU_PMUSEQ2 register */
#define PMU_PMUSEQ2_CMPBVAL_Pos               _UINT32_(6)                                          /* (PMU_PMUSEQ2)  Position */
#define PMU_PMUSEQ2_CMPBVAL_Msk               (_UINT32_(0x1) << PMU_PMUSEQ2_CMPBVAL_Pos)           /* (PMU_PMUSEQ2)  Mask */
#define PMU_PMUSEQ2_CMPBVAL(value)            (PMU_PMUSEQ2_CMPBVAL_Msk & (_UINT32_(value) << PMU_PMUSEQ2_CMPBVAL_Pos)) /* Assigment of value for CMPBVAL in the PMU_PMUSEQ2 register */
#define PMU_PMUSEQ2_CMD_Pos                   _UINT32_(7)                                          /* (PMU_PMUSEQ2)  Position */
#define PMU_PMUSEQ2_CMD_Msk                   (_UINT32_(0x1) << PMU_PMUSEQ2_CMD_Pos)               /* (PMU_PMUSEQ2)  Mask */
#define PMU_PMUSEQ2_CMD(value)                (PMU_PMUSEQ2_CMD_Msk & (_UINT32_(value) << PMU_PMUSEQ2_CMD_Pos)) /* Assigment of value for CMD in the PMU_PMUSEQ2 register */
#define PMU_PMUSEQ2_SPIRADDR_Pos              _UINT32_(8)                                          /* (PMU_PMUSEQ2)  Position */
#define PMU_PMUSEQ2_SPIRADDR_Msk              (_UINT32_(0xFF) << PMU_PMUSEQ2_SPIRADDR_Pos)         /* (PMU_PMUSEQ2)  Mask */
#define PMU_PMUSEQ2_SPIRADDR(value)           (PMU_PMUSEQ2_SPIRADDR_Msk & (_UINT32_(value) << PMU_PMUSEQ2_SPIRADDR_Pos)) /* Assigment of value for SPIRADDR in the PMU_PMUSEQ2 register */
#define PMU_PMUSEQ2_SPIDATA_Pos               _UINT32_(16)                                         /* (PMU_PMUSEQ2)  Position */
#define PMU_PMUSEQ2_SPIDATA_Msk               (_UINT32_(0xFFFF) << PMU_PMUSEQ2_SPIDATA_Pos)        /* (PMU_PMUSEQ2)  Mask */
#define PMU_PMUSEQ2_SPIDATA(value)            (PMU_PMUSEQ2_SPIDATA_Msk & (_UINT32_(value) << PMU_PMUSEQ2_SPIDATA_Pos)) /* Assigment of value for SPIDATA in the PMU_PMUSEQ2 register */
#define PMU_PMUSEQ2_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PMU_PMUSEQ2) Register Mask  */


/* -------- PMU_PMUSEQ3 : (PMU Offset: 0x30) (R/W 32)  -------- */
#define PMU_PMUSEQ3_RESETVALUE                _UINT32_(0x00)                                       /*  (PMU_PMUSEQ3)   Reset Value */

#define PMU_PMUSEQ3_DELAY_Pos                 _UINT32_(0)                                          /* (PMU_PMUSEQ3)  Position */
#define PMU_PMUSEQ3_DELAY_Msk                 (_UINT32_(0x3F) << PMU_PMUSEQ3_DELAY_Pos)            /* (PMU_PMUSEQ3)  Mask */
#define PMU_PMUSEQ3_DELAY(value)              (PMU_PMUSEQ3_DELAY_Msk & (_UINT32_(value) << PMU_PMUSEQ3_DELAY_Pos)) /* Assigment of value for DELAY in the PMU_PMUSEQ3 register */
#define PMU_PMUSEQ3_CMPBVAL_Pos               _UINT32_(6)                                          /* (PMU_PMUSEQ3)  Position */
#define PMU_PMUSEQ3_CMPBVAL_Msk               (_UINT32_(0x1) << PMU_PMUSEQ3_CMPBVAL_Pos)           /* (PMU_PMUSEQ3)  Mask */
#define PMU_PMUSEQ3_CMPBVAL(value)            (PMU_PMUSEQ3_CMPBVAL_Msk & (_UINT32_(value) << PMU_PMUSEQ3_CMPBVAL_Pos)) /* Assigment of value for CMPBVAL in the PMU_PMUSEQ3 register */
#define PMU_PMUSEQ3_CMD_Pos                   _UINT32_(7)                                          /* (PMU_PMUSEQ3)  Position */
#define PMU_PMUSEQ3_CMD_Msk                   (_UINT32_(0x1) << PMU_PMUSEQ3_CMD_Pos)               /* (PMU_PMUSEQ3)  Mask */
#define PMU_PMUSEQ3_CMD(value)                (PMU_PMUSEQ3_CMD_Msk & (_UINT32_(value) << PMU_PMUSEQ3_CMD_Pos)) /* Assigment of value for CMD in the PMU_PMUSEQ3 register */
#define PMU_PMUSEQ3_SPIRADDR_Pos              _UINT32_(8)                                          /* (PMU_PMUSEQ3)  Position */
#define PMU_PMUSEQ3_SPIRADDR_Msk              (_UINT32_(0xFF) << PMU_PMUSEQ3_SPIRADDR_Pos)         /* (PMU_PMUSEQ3)  Mask */
#define PMU_PMUSEQ3_SPIRADDR(value)           (PMU_PMUSEQ3_SPIRADDR_Msk & (_UINT32_(value) << PMU_PMUSEQ3_SPIRADDR_Pos)) /* Assigment of value for SPIRADDR in the PMU_PMUSEQ3 register */
#define PMU_PMUSEQ3_SPIDATA_Pos               _UINT32_(16)                                         /* (PMU_PMUSEQ3)  Position */
#define PMU_PMUSEQ3_SPIDATA_Msk               (_UINT32_(0xFFFF) << PMU_PMUSEQ3_SPIDATA_Pos)        /* (PMU_PMUSEQ3)  Mask */
#define PMU_PMUSEQ3_SPIDATA(value)            (PMU_PMUSEQ3_SPIDATA_Msk & (_UINT32_(value) << PMU_PMUSEQ3_SPIDATA_Pos)) /* Assigment of value for SPIDATA in the PMU_PMUSEQ3 register */
#define PMU_PMUSEQ3_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PMU_PMUSEQ3) Register Mask  */


/* -------- PMU_PMUSEQ4 : (PMU Offset: 0x34) (R/W 32)  -------- */
#define PMU_PMUSEQ4_RESETVALUE                _UINT32_(0x00)                                       /*  (PMU_PMUSEQ4)   Reset Value */

#define PMU_PMUSEQ4_DELAY_Pos                 _UINT32_(0)                                          /* (PMU_PMUSEQ4)  Position */
#define PMU_PMUSEQ4_DELAY_Msk                 (_UINT32_(0x3F) << PMU_PMUSEQ4_DELAY_Pos)            /* (PMU_PMUSEQ4)  Mask */
#define PMU_PMUSEQ4_DELAY(value)              (PMU_PMUSEQ4_DELAY_Msk & (_UINT32_(value) << PMU_PMUSEQ4_DELAY_Pos)) /* Assigment of value for DELAY in the PMU_PMUSEQ4 register */
#define PMU_PMUSEQ4_CMPBVAL_Pos               _UINT32_(6)                                          /* (PMU_PMUSEQ4)  Position */
#define PMU_PMUSEQ4_CMPBVAL_Msk               (_UINT32_(0x1) << PMU_PMUSEQ4_CMPBVAL_Pos)           /* (PMU_PMUSEQ4)  Mask */
#define PMU_PMUSEQ4_CMPBVAL(value)            (PMU_PMUSEQ4_CMPBVAL_Msk & (_UINT32_(value) << PMU_PMUSEQ4_CMPBVAL_Pos)) /* Assigment of value for CMPBVAL in the PMU_PMUSEQ4 register */
#define PMU_PMUSEQ4_CMD_Pos                   _UINT32_(7)                                          /* (PMU_PMUSEQ4)  Position */
#define PMU_PMUSEQ4_CMD_Msk                   (_UINT32_(0x1) << PMU_PMUSEQ4_CMD_Pos)               /* (PMU_PMUSEQ4)  Mask */
#define PMU_PMUSEQ4_CMD(value)                (PMU_PMUSEQ4_CMD_Msk & (_UINT32_(value) << PMU_PMUSEQ4_CMD_Pos)) /* Assigment of value for CMD in the PMU_PMUSEQ4 register */
#define PMU_PMUSEQ4_SPIRADDR_Pos              _UINT32_(8)                                          /* (PMU_PMUSEQ4)  Position */
#define PMU_PMUSEQ4_SPIRADDR_Msk              (_UINT32_(0xFF) << PMU_PMUSEQ4_SPIRADDR_Pos)         /* (PMU_PMUSEQ4)  Mask */
#define PMU_PMUSEQ4_SPIRADDR(value)           (PMU_PMUSEQ4_SPIRADDR_Msk & (_UINT32_(value) << PMU_PMUSEQ4_SPIRADDR_Pos)) /* Assigment of value for SPIRADDR in the PMU_PMUSEQ4 register */
#define PMU_PMUSEQ4_SPIDATA_Pos               _UINT32_(16)                                         /* (PMU_PMUSEQ4)  Position */
#define PMU_PMUSEQ4_SPIDATA_Msk               (_UINT32_(0xFFFF) << PMU_PMUSEQ4_SPIDATA_Pos)        /* (PMU_PMUSEQ4)  Mask */
#define PMU_PMUSEQ4_SPIDATA(value)            (PMU_PMUSEQ4_SPIDATA_Msk & (_UINT32_(value) << PMU_PMUSEQ4_SPIDATA_Pos)) /* Assigment of value for SPIDATA in the PMU_PMUSEQ4 register */
#define PMU_PMUSEQ4_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PMU_PMUSEQ4) Register Mask  */


