Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pmu.h
/* -------- PMU_WCMRDATA : (PMU Offset: 0x44) (R/W 32)  -------- */
#define PMU_WCMRDATA_RESETVALUE               _UINT32_(0x00)                                       /*  (PMU_WCMRDATA)   Reset Value */

#define PMU_WCMRDATA_WCMRDATA_Pos             _UINT32_(0)                                          /* (PMU_WCMRDATA)  Position */
#define PMU_WCMRDATA_WCMRDATA_Msk             (_UINT32_(0xFFFFFFFF) << PMU_WCMRDATA_WCMRDATA_Pos)  /* (PMU_WCMRDATA)  Mask */
#define PMU_WCMRDATA_WCMRDATA(value)          (PMU_WCMRDATA_WCMRDATA_Msk & (_UINT32_(value) << PMU_WCMRDATA_WCMRDATA_Pos)) /* Assigment of value for WCMRDATA in the PMU_WCMRDATA register */
#define PMU_WCMRDATA_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (PMU_WCMRDATA) Register Mask  */


/* -------- PMU_VBCCMD : (PMU Offset: 0x48) (R/W 32)  -------- */
#define PMU_VBCCMD_RESETVALUE                 _UINT32_(0x00)                                       /*  (PMU_VBCCMD)   Reset Value */

#define PMU_VBCCMD_VBCADDR_Pos                _UINT32_(0)                                          /* (PMU_VBCCMD)  Position */
#define PMU_VBCCMD_VBCADDR_Msk                (_UINT32_(0xFFFF) << PMU_VBCCMD_VBCADDR_Pos)         /* (PMU_VBCCMD)  Mask */
#define PMU_VBCCMD_VBCADDR(value)             (PMU_VBCCMD_VBCADDR_Msk & (_UINT32_(value) << PMU_VBCCMD_VBCADDR_Pos)) /* Assigment of value for VBCADDR in the PMU_VBCCMD register */
#define PMU_VBCCMD_VBCRDY_Pos                 _UINT32_(28)                                         /* (PMU_VBCCMD)  Position */
#define PMU_VBCCMD_VBCRDY_Msk                 (_UINT32_(0x1) << PMU_VBCCMD_VBCRDY_Pos)             /* (PMU_VBCCMD)  Mask */
#define PMU_VBCCMD_VBCRDY(value)              (PMU_VBCCMD_VBCRDY_Msk & (_UINT32_(value) << PMU_VBCCMD_VBCRDY_Pos)) /* Assigment of value for VBCRDY in the PMU_VBCCMD register */
#define PMU_VBCCMD_CMD_Pos                    _UINT32_(30)                                         /* (PMU_VBCCMD)  Position */
#define PMU_VBCCMD_CMD_Msk                    (_UINT32_(0x1) << PMU_VBCCMD_CMD_Pos)                /* (PMU_VBCCMD)  Mask */
#define PMU_VBCCMD_CMD(value)                 (PMU_VBCCMD_CMD_Msk & (_UINT32_(value) << PMU_VBCCMD_CMD_Pos)) /* Assigment of value for CMD in the PMU_VBCCMD register */
#define PMU_VBCCMD_Msk                        _UINT32_(0x5000FFFF)                                 /* (PMU_VBCCMD) Register Mask  */


/* -------- PMU_VBCWDATA : (PMU Offset: 0x4C) (R/W 32)  -------- */
#define PMU_VBCWDATA_RESETVALUE               _UINT32_(0x00)                                       /*  (PMU_VBCWDATA)   Reset Value */

#define PMU_VBCWDATA_VBCWDATA_Pos             _UINT32_(0)                                          /* (PMU_VBCWDATA)  Position */
#define PMU_VBCWDATA_VBCWDATA_Msk             (_UINT32_(0xFFFFFFFF) << PMU_VBCWDATA_VBCWDATA_Pos)  /* (PMU_VBCWDATA)  Mask */
#define PMU_VBCWDATA_VBCWDATA(value)          (PMU_VBCWDATA_VBCWDATA_Msk & (_UINT32_(value) << PMU_VBCWDATA_VBCWDATA_Pos)) /* Assigment of value for VBCWDATA in the PMU_VBCWDATA register */
#define PMU_VBCWDATA_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (PMU_VBCWDATA) Register Mask  */


/* -------- PMU_VBCRDATA : (PMU Offset: 0x50) (R/W 32)  -------- */
#define PMU_VBCRDATA_RESETVALUE               _UINT32_(0x00)                                       /*  (PMU_VBCRDATA)   Reset Value */

#define PMU_VBCRDATA_VBCRDATA_Pos             _UINT32_(0)                                          /* (PMU_VBCRDATA)  Position */
#define PMU_VBCRDATA_VBCRDATA_Msk             (_UINT32_(0xFFFFFFFF) << PMU_VBCRDATA_VBCRDATA_Pos)  /* (PMU_VBCRDATA)  Mask */
#define PMU_VBCRDATA_VBCRDATA(value)          (PMU_VBCRDATA_VBCRDATA_Msk & (_UINT32_(value) << PMU_VBCRDATA_VBCRDATA_Pos)) /* Assigment of value for VBCRDATA in the PMU_VBCRDATA register */
#define PMU_VBCRDATA_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (PMU_VBCRDATA) Register Mask  */


/* -------- PMU_WCMCFG : (PMU Offset: 0x54) (R/W 32)  -------- */
#define PMU_WCMCFG_RESETVALUE                 _UINT32_(0x00)                                       /*  (PMU_WCMCFG)   Reset Value */

#define PMU_WCMCFG_WCM1CFG_Pos                _UINT32_(0)                                          /* (PMU_WCMCFG)  Position */
#define PMU_WCMCFG_WCM1CFG_Msk                (_UINT32_(0x7) << PMU_WCMCFG_WCM1CFG_Pos)            /* (PMU_WCMCFG)  Mask */
#define PMU_WCMCFG_WCM1CFG(value)             (PMU_WCMCFG_WCM1CFG_Msk & (_UINT32_(value) << PMU_WCMCFG_WCM1CFG_Pos)) /* Assigment of value for WCM1CFG in the PMU_WCMCFG register */
#define PMU_WCMCFG_WCM2CFG_Pos                _UINT32_(4)                                          /* (PMU_WCMCFG)  Position */
#define PMU_WCMCFG_WCM2CFG_Msk                (_UINT32_(0x7) << PMU_WCMCFG_WCM2CFG_Pos)            /* (PMU_WCMCFG)  Mask */
#define PMU_WCMCFG_WCM2CFG(value)             (PMU_WCMCFG_WCM2CFG_Msk & (_UINT32_(value) << PMU_WCMCFG_WCM2CFG_Pos)) /* Assigment of value for WCM2CFG in the PMU_WCMCFG register */
#define PMU_WCMCFG_Msk                        _UINT32_(0x00000077)                                 /* (PMU_WCMCFG) Register Mask  */


/* -------- PMU_PMUIENB : (PMU Offset: 0x58) (R/W 32)  -------- */
#define PMU_PMUIENB_RESETVALUE                _UINT32_(0x00)                                       /*  (PMU_PMUIENB)   Reset Value */

#define PMU_PMUIENB_ADCBORIEN_Pos             _UINT32_(0)                                          /* (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_ADCBORIEN_Msk             (_UINT32_(0x1) << PMU_PMUIENB_ADCBORIEN_Pos)         /* (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_ADCBORIEN(value)          (PMU_PMUIENB_ADCBORIEN_Msk & (_UINT32_(value) << PMU_PMUIENB_ADCBORIEN_Pos)) /* Assigment of value for ADCBORIEN in the PMU_PMUIENB register */
#define PMU_PMUIENB_BUCKBORIEN_Pos            _UINT32_(1)                                          /* (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_BUCKBORIEN_Msk            (_UINT32_(0x1) << PMU_PMUIENB_BUCKBORIEN_Pos)        /* (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_BUCKBORIEN(value)         (PMU_PMUIENB_BUCKBORIEN_Msk & (_UINT32_(value) << PMU_PMUIENB_BUCKBORIEN_Pos)) /* Assigment of value for BUCKBORIEN in the PMU_PMUIENB register */
#define PMU_PMUIENB_SCMPIEN_Pos               _UINT32_(2)                                          /* (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_SCMPIEN_Msk               (_UINT32_(0x1) << PMU_PMUIENB_SCMPIEN_Pos)           /* (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_SCMPIEN(value)            (PMU_PMUIENB_SCMPIEN_Msk & (_UINT32_(value) << PMU_PMUIENB_SCMPIEN_Pos)) /* Assigment of value for SCMPIEN in the PMU_PMUIENB register */
#define PMU_PMUIENB_WCMIAIEN_Pos              _UINT32_(3)                                          /* (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_WCMIAIEN_Msk              (_UINT32_(0x1) << PMU_PMUIENB_WCMIAIEN_Pos)          /* (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_WCMIAIEN(value)           (PMU_PMUIENB_WCMIAIEN_Msk & (_UINT32_(value) << PMU_PMUIENB_WCMIAIEN_Pos)) /* Assigment of value for WCMIAIEN in the PMU_PMUIENB register */
#define PMU_PMUIENB_VBCIAIEN_Pos              _UINT32_(4)                                          /* (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_VBCIAIEN_Msk              (_UINT32_(0x1) << PMU_PMUIENB_VBCIAIEN_Pos)          /* (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_VBCIAIEN(value)           (PMU_PMUIENB_VBCIAIEN_Msk & (_UINT32_(value) << PMU_PMUIENB_VBCIAIEN_Pos)) /* Assigment of value for VBCIAIEN in the PMU_PMUIENB register */
#define PMU_PMUIENB_Msk                       _UINT32_(0x0000001F)                                 /* (PMU_PMUIENB) Register Mask  */


/* -------- PMU_PMUISTAT : (PMU Offset: 0x5C) (R/W 32)  -------- */
#define PMU_PMUISTAT_RESETVALUE               _UINT32_(0x00)                                       /*  (PMU_PMUISTAT)   Reset Value */

#define PMU_PMUISTAT_ADCBORINT_Pos            _UINT32_(0)                                          /* (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_ADCBORINT_Msk            (_UINT32_(0x1) << PMU_PMUISTAT_ADCBORINT_Pos)        /* (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_ADCBORINT(value)         (PMU_PMUISTAT_ADCBORINT_Msk & (_UINT32_(value) << PMU_PMUISTAT_ADCBORINT_Pos)) /* Assigment of value for ADCBORINT in the PMU_PMUISTAT register */
#define PMU_PMUISTAT_BUCKBORINT_Pos           _UINT32_(1)                                          /* (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_BUCKBORINT_Msk           (_UINT32_(0x1) << PMU_PMUISTAT_BUCKBORINT_Pos)       /* (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_BUCKBORINT(value)        (PMU_PMUISTAT_BUCKBORINT_Msk & (_UINT32_(value) << PMU_PMUISTAT_BUCKBORINT_Pos)) /* Assigment of value for BUCKBORINT in the PMU_PMUISTAT register */
#define PMU_PMUISTAT_SCMPINT_Pos              _UINT32_(2)                                          /* (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_SCMPINT_Msk              (_UINT32_(0x1) << PMU_PMUISTAT_SCMPINT_Pos)          /* (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_SCMPINT(value)           (PMU_PMUISTAT_SCMPINT_Msk & (_UINT32_(value) << PMU_PMUISTAT_SCMPINT_Pos)) /* Assigment of value for SCMPINT in the PMU_PMUISTAT register */
#define PMU_PMUISTAT_WCMIAINT_Pos             _UINT32_(3)                                          /* (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_WCMIAINT_Msk             (_UINT32_(0x1) << PMU_PMUISTAT_WCMIAINT_Pos)         /* (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_WCMIAINT(value)          (PMU_PMUISTAT_WCMIAINT_Msk & (_UINT32_(value) << PMU_PMUISTAT_WCMIAINT_Pos)) /* Assigment of value for WCMIAINT in the PMU_PMUISTAT register */
#define PMU_PMUISTAT_VBCIAINT_Pos             _UINT32_(4)                                          /* (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_VBCIAINT_Msk             (_UINT32_(0x1) << PMU_PMUISTAT_VBCIAINT_Pos)         /* (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_VBCIAINT(value)          (PMU_PMUISTAT_VBCIAINT_Msk & (_UINT32_(value) << PMU_PMUISTAT_VBCIAINT_Pos)) /* Assigment of value for VBCIAINT in the PMU_PMUISTAT register */
#define PMU_PMUISTAT_Msk                      _UINT32_(0x0000001F)                                 /* (PMU_PMUISTAT) Register Mask  */


/** \brief PMU register offsets definitions */
#define PMU_SPICTRL_REG_OFST           _UINT32_(0x00)      /* (PMU_SPICTRL)  Offset */
#define PMU_SPISTATUS_REG_OFST         _UINT32_(0x04)      /* (PMU_SPISTATUS)  Offset */
#define PMU_CLKCTRL_REG_OFST           _UINT32_(0x08)      /* (PMU_CLKCTRL)  Offset */
#define PMU_MODECTRL1_REG_OFST         _UINT32_(0x0C)      /* (PMU_MODECTRL1)  Offset */
#define PMU_MODECTRL2_REG_OFST         _UINT32_(0x10)      /* (PMU_MODECTRL2)  Offset */
#define PMU_MODECTRL3_REG_OFST         _UINT32_(0x14)      /* (PMU_MODECTRL3)  Offset */
#define PMU_MODECTRL4_REG_OFST         _UINT32_(0x18)      /* (PMU_MODECTRL4)  Offset */
#define PMU_OVERCTRL_REG_OFST          _UINT32_(0x1C)      /* (PMU_OVERCTRL)  Offset */
#define PMU_PMUCMODE_REG_OFST          _UINT32_(0x20)      /* (PMU_PMUCMODE)  Offset */
#define PMU_PMUSTATUS_REG_OFST         _UINT32_(0x24)      /* (PMU_PMUSTATUS)  Offset */
#define PMU_PMUSEQ1_REG_OFST           _UINT32_(0x28)      /* (PMU_PMUSEQ1)  Offset */
#define PMU_PMUSEQ2_REG_OFST           _UINT32_(0x2C)      /* (PMU_PMUSEQ2)  Offset */
#define PMU_PMUSEQ3_REG_OFST           _UINT32_(0x30)      /* (PMU_PMUSEQ3)  Offset */
#define PMU_PMUSEQ4_REG_OFST           _UINT32_(0x34)      /* (PMU_PMUSEQ4)  Offset */
#define PMU_PMUCFG_REG_OFST            _UINT32_(0x38)      /* (PMU_PMUCFG)  Offset */
#define PMU_WCMCMD_REG_OFST            _UINT32_(0x3C)      /* (PMU_WCMCMD)  Offset */
#define PMU_WCMWDATA_REG_OFST          _UINT32_(0x40)      /* (PMU_WCMWDATA)  Offset */
#define PMU_WCMRDATA_REG_OFST          _UINT32_(0x44)      /* (PMU_WCMRDATA)  Offset */
#define PMU_VBCCMD_REG_OFST            _UINT32_(0x48)      /* (PMU_VBCCMD)  Offset */
#define PMU_VBCWDATA_REG_OFST          _UINT32_(0x4C)      /* (PMU_VBCWDATA)  Offset */
#define PMU_VBCRDATA_REG_OFST          _UINT32_(0x50)      /* (PMU_VBCRDATA)  Offset */
#define PMU_WCMCFG_REG_OFST            _UINT32_(0x54)      /* (PMU_WCMCFG)  Offset */
#define PMU_PMUIENB_REG_OFST           _UINT32_(0x58)      /* (PMU_PMUIENB)  Offset */
#define PMU_PMUISTAT_REG_OFST          _UINT32_(0x5C)      /* (PMU_PMUISTAT)  Offset */

