Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pmu.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PMU register API structure */
typedef struct
{  /* PMU SPI controller */
  __IO  uint32_t                       PMU_SPICTRL;        /**< Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       PMU_SPISTATUS;      /**< Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       PMU_CLKCTRL;        /**< Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       PMU_MODECTRL1;      /**< Offset: 0x0C (R/W  32)  */
  __IO  uint32_t                       PMU_MODECTRL2;      /**< Offset: 0x10 (R/W  32)  */
  __IO  uint32_t                       PMU_MODECTRL3;      /**< Offset: 0x14 (R/W  32)  */
  __IO  uint32_t                       PMU_MODECTRL4;      /**< Offset: 0x18 (R/W  32)  */
  __IO  uint32_t                       PMU_OVERCTRL;       /**< Offset: 0x1C (R/W  32)  */
  __IO  uint32_t                       PMU_PMUCMODE;       /**< Offset: 0x20 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUSTATUS;      /**< Offset: 0x24 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUSEQ1;        /**< Offset: 0x28 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUSEQ2;        /**< Offset: 0x2C (R/W  32)  */
  __IO  uint32_t                       PMU_PMUSEQ3;        /**< Offset: 0x30 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUSEQ4;        /**< Offset: 0x34 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUCFG;         /**< Offset: 0x38 (R/W  32)  */
  __IO  uint32_t                       PMU_WCMCMD;         /**< Offset: 0x3C (R/W  32)  */
  __IO  uint32_t                       PMU_WCMWDATA;       /**< Offset: 0x40 (R/W  32)  */
  __IO  uint32_t                       PMU_WCMRDATA;       /**< Offset: 0x44 (R/W  32)  */
  __IO  uint32_t                       PMU_VBCCMD;         /**< Offset: 0x48 (R/W  32)  */
  __IO  uint32_t                       PMU_VBCWDATA;       /**< Offset: 0x4C (R/W  32)  */
  __IO  uint32_t                       PMU_VBCRDATA;       /**< Offset: 0x50 (R/W  32)  */
  __IO  uint32_t                       PMU_WCMCFG;         /**< Offset: 0x54 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUIENB;        /**< Offset: 0x58 (R/W  32)  */
  __IO  uint32_t                       PMU_PMUISTAT;       /**< Offset: 0x5C (R/W  32)  */
} pmu_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _BZ25_PMU_COMPONENT_H_ */
